#include <iostream>
#include <string>

using namespace std;

#ifdef _WIN32
string EmptyTable = "Данные об игроках отсутствуют. Используйте пункт \"Ввод\".";
string TitleTable = "    ИГРОКИ";
string ColumnTable[] = {
    "|",
    "     ",
    "|",
    "      Страна      ",
    "|",
    "       Клуб       ",
    "|",
    "       Имя        ",
    "|",
    "     Фамилия      ",
    "|",
    "      Амплуа      ",
    "|",
    " Голы ",
    "|",
    " Нарушения ",
    "|",
    "    Примечания    ",
    "|"
};

string AddPlayer =  "Выберите количество игроков для ввода:";
string Country   =  "    Страна ( ";
string Club      =  "    Клуб ( ";
string Firstname =  "    Имя: ";
string Lastname  =  "    Фамилия: ";
string Position  =  "    Амплуа ( ";
string Goals     =  "    Голы: ";
string Fouls     =  "    Нарушения: ";
string Misc      =  "    Дополнительная информация: ";

string SortField  =  "Выберите поле для сортировки ( 1-Голы 2-Нарушения ): ";
string SortDirect =  "Выберите направление сортировки ( 1-По возрастанию 2-По убывания ): ";

string DeletePlayer =  "Выберите игрока для удаления:";
string NotExist     =  "Такого игрока не существует. Попробуйте еще раз.";

string GoodPlayer =  "Самый полезный игрок: ";
string PlaysFor   =  " играет за ";
string Scored     =  " забил ";
string fGoals     =  " голов";

string PlayerCountry[] = {
    "Италия",
    "Испания",
    "Англия"
};

string PlayerClub[3][2] = {
    "Ювентус","Наполи",
    "Барселона","Реал",
    "Манчестер Сити","Челси"
};

string PlayerPosition[] = {
    "Голкипер",
    "Защитник",
    "Полузащитник",
    "Нападающий"
};

const char *OUT_FILE = "Out_win.txt";
#else
string EmptyTable    = "Р”Р°РЅРЅС‹Рµ РѕР± РёРіСЂРѕРєР°С… РѕС‚СЃСѓС‚СЃС‚РІСѓСЋС‚. РСЃРїРѕР»СЊР·СѓР№С‚Рµ РїСѓРЅРєС‚ \"Р’РІРѕРґ\".";
string TitleTable    = "    РР“Р РћРљР";
string ColumnTable[] = {
    "|",
    "     ",
    "|",
    "      РЎС‚СЂР°РЅР°      ",
    "|",
    "       РљР»СѓР±       ",
    "|",
    "       РРјСЏ        ",
    "|",
    "     Р¤Р°РјРёР»РёСЏ      ",
    "|",
    "      РђРјРїР»СѓР°      ",
    "|",
    " Р“РѕР»С‹ ",
    "|",
    " РќР°СЂСѓС€РµРЅРёСЏ ",
    "|",
    "    РџСЂРёРјРµС‡Р°РЅРёСЏ    ",
    "|"
};

string AddPlayer = "Р’С‹Р±РµСЂРёС‚Рµ РєРѕР»РёС‡РµСЃС‚РІРѕ РёРіСЂРѕРєРѕРІ РґР»СЏ РІРІРѕРґР°: ";
string Country   = "    РЎС‚СЂР°РЅР° ( ";
string Club      = "    РљР»СѓР± ( ";
string Firstname = "    РРјСЏ: ";
string Lastname  = "    Р¤Р°РјРёР»РёСЏ: ";
string Position  = "    РђРјРїР»СѓР° ( ";
string Goals     = "    Р“РѕР»С‹: ";
string Fouls     = "    РќР°СЂСѓС€РµРЅРёСЏ: ";
string Misc      = "    Р”РѕРїРѕР»РЅРёС‚РµР»СЊРЅР°СЏ РёРЅС„РѕСЂРјР°С†РёСЏ: ";

string SortField  = "Р’С‹Р±РµСЂРёС‚Рµ РїРѕР»Рµ РґР»СЏ СЃРѕСЂС‚РёСЂРѕРІРєРё ( 1-Р“РѕР»С‹ 2-РќР°СЂСѓС€РµРЅРёСЏ ): ";
string SortDirect = "Р’С‹Р±РµСЂРёС‚Рµ РЅР°РїСЂР°РІР»РµРЅРёРµ СЃРѕСЂС‚РёСЂРѕРІРєРё ( 1-РџРѕ РІРѕР·СЂР°СЃС‚Р°РЅРёСЋ 2-РџРѕ СѓР±С‹РІР°РЅРёСЏ ): ";

string DeletePlayer = "Р’С‹Р±РµСЂРёС‚Рµ РёРіСЂРѕРєР° РґР»СЏ СѓРґР°Р»РµРЅРёСЏ: ";
string NotExist     = "РўР°РєРѕРіРѕ РёРіСЂРѕРєР° РЅРµ СЃСѓС‰РµСЃС‚РІСѓРµС‚. РџРѕРїСЂРѕР±СѓР№С‚Рµ РµС‰Рµ СЂР°Р·.";

string GoodPlayer = "РЎР°РјС‹Р№ РїРѕР»РµР·РЅС‹Р№ РёРіСЂРѕРє: ";
string PlaysFor   = " РёРіСЂР°РµС‚ Р·Р° ";
string Scored     = " Р·Р°Р±РёР» ";
string fGoals     = " РіРѕР»РѕРІ";

string PlayerCountry[] = {
    "РС‚Р°Р»РёСЏ",
    "РСЃРїР°РЅРёСЏ",
    "РђРЅРіР»РёСЏ"
};

string PlayerClub[3][2] = {
    "Р®РІРµРЅС‚СѓСЃ","РќР°РїРѕР»Рё",
    "Р‘Р°СЂСЃРµР»РѕРЅР°","Р РµР°Р»",
    "РњР°РЅС‡РµСЃС‚РµСЂ РЎРёС‚Рё","Р§РµР»СЃРё"
};

string PlayerPosition[] = {
    "Р“РѕР»РєРёРїРµСЂ",
    "Р—Р°С‰РёС‚РЅРёРє",
    "РџРѕР»СѓР·Р°С‰РёС‚РЅРёРє",
    "РќР°РїР°РґР°СЋС‰РёР№"
};

const char *OUT_FILE = "Out.txt";
#endif
int ColumnTableCount = 19;
string RightBracket  = "): ";
