#include <iostream>
#include <string>

using namespace std;

#ifdef _WIN32
string PlayerCountry[] = {
    "Италия",
    "Испания",
    "Англия"
};

string PlayerClub[3][2] = {
    "Ювентус","Наполи",
    "Барселона","Реал",
    "Манчестер Сити","Челси"
};

string PlayerPosition[] = {
    "Голкипер",
    "Защитник",
    "Полузащитник",
    "Нападающий"
};
#else
string PlayerCountry[] = {
    "РС‚Р°Р»РёСЏ",
    "РСЃРїР°РЅРёСЏ",
    "РђРЅРіР»РёСЏ"
};

string PlayerClub[3][2] = {
    "Р®РІРµРЅС‚СѓСЃ","РќР°РїРѕР»Рё",
    "Р‘Р°СЂСЃРµР»РѕРЅР°","Р РµР°Р»",
    "РњР°РЅС‡РµСЃС‚РµСЂ РЎРёС‚Рё","Р§РµР»СЃРё"
};

string PlayerPosition[] = {
    "Р“РѕР»РєРёРїРµСЂ",
    "Р—Р°С‰РёС‚РЅРёРє",
    "РџРѕР»СѓР·Р°С‰РёС‚РЅРёРє",
    "РќР°РїР°РґР°СЋС‰РёР№"
};
#endif
